{
    "status": "ok",
    "totalResults": 36,
    "collected_at": "2024-11-04T03:31:22.370671",
    "articles": [
        {
            "title": "Kemi Badenoch promises change after historic Tory leadership win - BBC.com",
            "description": "The former business secretary is the first black woman to lead a major political party in the UK.",
            "url": "https://www.bbc.com/news/articles/c0qdnewgx19o",
            "source": "BBC News",
            "publishedAt": "2024-11-03T02:04:29Z"
        },
        {
            "title": "Youngkin, long coy about Trump, welcomes him to Virginia with tribute, prayer - The Washington Post",
            "description": "Donald Trump’s stop in Salem gave the Virginia governor another chance to showcase his newfound devotion to the nation’s 45th president.",
            "url": "https://www.washingtonpost.com/dc-md-va/2024/11/02/salem-virginia-trump-rally-youngkin/",
            "source": "The Washington Post",
            "publishedAt": "2024-11-03T02:00:42Z"
        },
        {
            "title": "Live from New York: Harris making surprise 'Saturday Night Live' appearance with election looming - The Associated Press",
            "description": "Live from New York, it’s a presidential candidate scrounging for every vote in the final days before the election. Vice President Kamala Harris made a surprise trip to New York City on Saturday to appear on “Saturday Night Live,” briefly stepping away from th…",
            "url": "https://apnews.com/article/harris-unscheduled-new-york-visit-f58069ca1db9ec077b092a52bd118ac5",
            "source": "Associated Press",
            "publishedAt": "2024-11-03T01:51:00Z"
        },
        {
            "title": "ULM to discipline OL coach Cameron Blankenship for irately berating, shoving player on sideline - Yahoo Sports",
            "description": "The most heated sideline in college football on Saturday came via just one man.",
            "url": "https://sports.yahoo.com/ulm-to-discipline-ol-coach-cameron-blankenship-for-irately-berating-shoving-player-on-sideline-013137832.html",
            "source": "Yahoo Entertainment",
            "publishedAt": "2024-11-03T01:49:00Z"
        },
        {
            "title": "Spain's deadly floods prompt government to send 10,000 soldiers, police to Valencia as death toll climbs to over 200 - CBS News",
            "description": "So far, 205 bodies have been recovered after the floods in Spain. Volunteers are helping clean up thick mud that is covering streets and businesses.",
            "url": "https://www.cbsnews.com/news/spain-deadly-floods-soldiers-police-valencia/",
            "source": "CBS News",
            "publishedAt": "2024-11-03T01:18:51Z"
        },
        {
            "title": "Texas Tech uses late TD to end perfect ISU start - ESPN",
            "description": "Behren Morton drove Texas Tech 71 yards for the winning touchdown with 20 seconds left, and the Red Raiders denied No. 11 Iowa State its best start in program history with a 23-22 upset Saturday.",
            "url": "https://www.espn.com/college-football/story/_/id/42156317/texas-tech-downs-previously-unbeaten-iowa-state-late-td",
            "source": "ESPN",
            "publishedAt": "2024-11-03T00:58:00Z"
        },
        {
            "title": "Israel says Hezbollah operative captured in naval raid - BBC.com",
            "description": "The office of Lebanese Prime Minister Najib Mikati said the country would submit a complaint to the UN Security Council.",
            "url": "https://www.bbc.com/news/articles/cm2zeyvpnkxo",
            "source": "BBC News",
            "publishedAt": "2024-11-02T23:49:00Z"
        },
        {
            "title": "Ohio State win, Iowa State loss headline college football Week 10 winners and losers - USA TODAY",
            "description": "There are ups and downs each college football weekend. The Week 10 winners and losers include Ohio State's crucial win and Iowa State's first loss.",
            "url": "https://www.usatoday.com/story/sports/ncaaf/2024/11/02/college-football-week-10-winners-losers-ohio-state-iowa-state/76011440007/",
            "source": "USA Today",
            "publishedAt": "2024-11-02T23:46:24Z"
        },
        {
            "title": "Trump says migrants caused a ‘surge in crime’ in a small Wisconsin city. Its residents reject that. - POLITICO",
            "description": "Donald Trump has constructed his campaign on the idea that “bloodthirsty” immigrants are taking over towns across the U.S.",
            "url": "https://www.politico.com/news/2024/11/02/trump-candidacy-false-migrant-invasion-00186875",
            "source": "Politico",
            "publishedAt": "2024-11-02T23:37:56Z"
        },
        {
            "title": "Georgia judge rejects Republican lawsuit seeking to block acceptance of hand-returned mail ballots in Fulton County - CBS News",
            "description": "The judge rejected a Republican lawsuit trying to block counties from opening election offices on Saturday and Sunday to let voters hand in their mail ballots in person.",
            "url": "https://www.cbsnews.com/news/georgia-judge-republican-lawsuit-hand-returned-mail-ballots-fulton-county/",
            "source": "CBS News",
            "publishedAt": "2024-11-02T23:24:55Z"
        },
        {
            "title": "Is it legal to have a pet squirrel? Beloved Peanut the squirrel euthanized in New York - USA TODAY",
            "description": "Wildlife rehabilitators can legally care for injured or sick squirrels, but the animals can't be pets in many states.",
            "url": "https://www.usatoday.com/story/news/nation/2024/11/02/peanut-squirrel-euthanized-legal/76009885007/",
            "source": "USA Today",
            "publishedAt": "2024-11-02T23:10:13Z"
        },
        {
            "title": "Florida’s convicted killer clown released from prison for the murder of her husband’s then-wife - WPBF West Palm Beach",
            "description": "A woman who pleaded guilty to dressing as a clown and in 1990 murdering the wife of a man she later married was released from prison Saturday.",
            "url": "https://www.wpbf.com/article/floridas-convicted-killer-clown-released-from-prison-for-the-murder-of-her-husbands-then-wife/62793235",
            "source": "WPBF West Palm Beach",
            "publishedAt": "2024-11-02T23:03:00Z"
        },
        {
            "title": "Margot Robbie Gives Birth to Her and Tom Ackerly’s First Baby - Harper's BAZAAR",
            "description": "They welcomed a baby boy earlier this month.",
            "url": "https://www.harpersbazaar.com/celebrity/latest/a62793132/margot-robbie-gives-birth-first-baby-tom-ackerly/",
            "source": "HarpersBAZAAR.com",
            "publishedAt": "2024-11-02T22:20:00Z"
        },
        {
            "title": "Third ‘Venom’ film tops box office, Tom Hanks flick debuts third - New York Post ",
            "description": "“Venom: The Last Dance” earned another $6.6 million in ticket sales during its second week in theaters, and holds steady at No. 1, according to The Numbers.",
            "url": "https://nypost.com/2024/11/02/entertainment/third-venom-film-spends-second-week-at-no-1/",
            "source": "New York Post",
            "publishedAt": "2024-11-02T22:11:00Z"
        },
        {
            "title": "DJ Lagway injury: Florida's freshman phenom QB carted from field during Georgia game - CBS Sports",
            "description": "Lagway was on the sideline with crutches and in street clothes after suffering an apparent non-contact injury in the second quarter",
            "url": "https://www.cbssports.com/college-football/news/dj-lagway-injury-floridas-freshman-phenom-qb-carted-from-field-during-georgia-game/",
            "source": "CBS Sports",
            "publishedAt": "2024-11-02T22:09:00Z"
        },
        {
            "title": "Apple’s new M4 Max is the fastest CPU on the market, and we haven’t even seen M4 Ultra - 9to5Mac",
            "description": "Apple unveiled its new MacBook Pro models this week, with M4, M4 Pro, and M4 Max chipsets. The new M4...",
            "url": "https://9to5mac.com/2024/11/02/apple-m4-max-geekbench-macbook-pro/",
            "source": "9to5Mac",
            "publishedAt": "2024-11-02T22:00:00Z"
        },
        {
            "title": "Harris and Trump campaign in Southern battlegrounds 3 days before election - CNN",
            "description": "With only three days until Election Day, Vice President Kamala Harris and former President Donald Trump are racing to deliver their closing pitches to voters in key battleground states. Follow here for the latest live news updates.",
            "url": "https://www.cnn.com/politics/live-news/trump-harris-election-11-02-24/index.html",
            "source": "CNN",
            "publishedAt": "2024-11-02T21:32:00Z"
        },
        {
            "title": "Warren Buffett is sitting on over $325 billion cash as Berkshire Hathaway keeps selling Apple stock - The Associated Press",
            "description": "Warren Buffett is now sitting on more than $325 billion cash after continuing to unload billions of dollars worth of Apple and Bank of America shares this year and continuing to collect a steady stream of profits from all of Berkshire Hathaway’s assorted busi…",
            "url": "https://apnews.com/article/warren-buffett-berkshire-hathaway-earnings-profit-6f2772721d5d8f00578f8265c70db3d1",
            "source": "Associated Press",
            "publishedAt": "2024-11-02T21:15:00Z"
        },
        {
            "title": "Ukraine’s Zelenskyy urges allies to act before N Korean troops reach front - Al Jazeera English",
            "description": "Zelenskyy raises the prospect of a preemptive Ukrainian strike on camps where the North Korean troops are being trained.",
            "url": "https://www.aljazeera.com/news/2024/11/2/ukraines-zelenskyy-urges-allies-to-act-before-n-korean-troops-reach-front",
            "source": "Al Jazeera English",
            "publishedAt": "2024-11-02T20:53:48Z"
        },
        {
            "title": "WWE Crown Jewel 2024 Results: Winners, Live Grades, Reaction and Highlights - Bleacher Report",
            "description": "Welcome to Bleacher Report's live coverage of WWE Crown Jewel 2024. Instead of getting matches for the top men's and women's titles, WWE has decided to pit…",
            "url": "https://bleacherreport.com/articles/10141893-wwe-crown-jewel-2024-results-winners-live-grades-reaction-and-highlights",
            "source": "Bleacher Report",
            "publishedAt": "2024-11-02T20:52:32Z"
        }
    ]
}